# DataFrames

DataFrame is like a combination Series objects put together to share the same index.

In [1]:
import pandas as pd
import numpy as np

In [17]:
from numpy.random import randn

In [18]:
df = pd.DataFrame(randn(5,4),index=["A","B","C","D","E"],columns= ["W","X","Y","Z"])

In [19]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [21]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.281744  0.162672 -0.499719  0.387812
std    1.338333  1.000436  0.743748  0.550728
min   -0.993263 -0.610259 -1.136645 -0.346419
25%   -0.925874 -0.479448 -1.133817  0.000366
50%    0.147027 -0.156598 -0.755325  0.610478
75%    1.025984  0.196800 -0.031579  0.649826
max    2.154846  1.862864  0.558769  1.024810

In [22]:
#Checking for null values in a dataframe
df.isnull()

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False  False  False  False

In [31]:
#Checking for not null values in a dataframe at a column level
df.isnull().sum()

W    0
X    0
Y    0
Z    0
dtype: int64

In [35]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [39]:
# Sample of subsetting the data in a dataframe based on a condition

df[df["X"]>=0]

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
E -0.925874  1.862864 -1.133817  0.610478

In [33]:
#printing the first five row/records in a dataframe
df.head()

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [34]:
# Subsetting the data only for not null values
new_df = df[~df["W"].isnull()]
new_df.tail() #tail prints the last five records of a dataframe

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [40]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [43]:
df[["Z","X"]]

          Z         X
A  0.000366  0.196800
B  0.649826 -0.156598
C -0.346419 -0.610259
D  1.024810 -0.479448
E  0.610478  1.862864

In [44]:
# Pass a list of column names
new = df[['W','Z']]
new

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [47]:
df.W

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

DataFrame Columns are just Series

In [48]:
type(df['W'])

pandas.core.series.Series

In [49]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

**Creating a new column:**

In [50]:
df["multi"] = df["X"]*df["Z"]
df

          W         X         Y         Z     multi
A -0.993263  0.196800 -1.136645  0.000366  0.000072
B  1.025984 -0.156598 -0.031579  0.649826 -0.101761
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405
D  0.147027 -0.479448  0.558769  1.024810 -0.491343
E -0.925874  1.862864 -1.133817  0.610478  1.137237

In [51]:
df['new_colname'] = df['W'] + df['Y']

In [52]:
df

          W         X         Y         Z     multi  new_colname
A -0.993263  0.196800 -1.136645  0.000366  0.000072    -2.129908
B  1.025984 -0.156598 -0.031579  0.649826 -0.101761     0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405     1.399521
D  0.147027 -0.479448  0.558769  1.024810 -0.491343     0.705796
E -0.925874  1.862864 -1.133817  0.610478  1.137237    -2.059691

In [53]:
df["flag"] = "Correct"

In [54]:
df

          W         X         Y         Z     multi  new_colname     flag
A -0.993263  0.196800 -1.136645  0.000366  0.000072    -2.129908  Correct
B  1.025984 -0.156598 -0.031579  0.649826 -0.101761     0.994405  Correct
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405     1.399521  Correct
D  0.147027 -0.479448  0.558769  1.024810 -0.491343     0.705796  Correct
E -0.925874  1.862864 -1.133817  0.610478  1.137237    -2.059691  Correct

** Removing Columns**

In [55]:
df.drop('new_colname',axis=1)

          W         X         Y         Z     multi     flag
A -0.993263  0.196800 -1.136645  0.000366  0.000072  Correct
B  1.025984 -0.156598 -0.031579  0.649826 -0.101761  Correct
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405  Correct
D  0.147027 -0.479448  0.558769  1.024810 -0.491343  Correct
E -0.925874  1.862864 -1.133817  0.610478  1.137237  Correct

In [56]:
# Not inplace unless you specify it
df

          W         X         Y         Z     multi  new_colname     flag
A -0.993263  0.196800 -1.136645  0.000366  0.000072    -2.129908  Correct
B  1.025984 -0.156598 -0.031579  0.649826 -0.101761     0.994405  Correct
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405     1.399521  Correct
D  0.147027 -0.479448  0.558769  1.024810 -0.491343     0.705796  Correct
E -0.925874  1.862864 -1.133817  0.610478  1.137237    -2.059691  Correct

In [57]:
df.drop('new_colname',axis=1,inplace=True)

In [58]:
df

          W         X         Y         Z     multi     flag
A -0.993263  0.196800 -1.136645  0.000366  0.000072  Correct
B  1.025984 -0.156598 -0.031579  0.649826 -0.101761  Correct
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405  Correct
D  0.147027 -0.479448  0.558769  1.024810 -0.491343  Correct
E -0.925874  1.862864 -1.133817  0.610478  1.137237  Correct

In [59]:
df2=df.drop("multi",axis=1)
df2

          W         X         Y         Z     flag
A -0.993263  0.196800 -1.136645  0.000366  Correct
B  1.025984 -0.156598 -0.031579  0.649826  Correct
C  2.154846 -0.610259 -0.755325 -0.346419  Correct
D  0.147027 -0.479448  0.558769  1.024810  Correct
E -0.925874  1.862864 -1.133817  0.610478  Correct

Can also drop rows this way:

In [60]:
df.drop('E',axis=0)

          W         X         Y         Z     multi     flag
A -0.993263  0.196800 -1.136645  0.000366  0.000072  Correct
B  1.025984 -0.156598 -0.031579  0.649826 -0.101761  Correct
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405  Correct
D  0.147027 -0.479448  0.558769  1.024810 -0.491343  Correct

Selecting/subsetting Rows

In [61]:
df[df["W"] > 2]

          W         X         Y         Z     multi     flag
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405  Correct

In [75]:
df.loc['A']

W       -0.993263
X          0.1968
Y       -1.136645
Z        0.000366
multi    0.000072
flag      Correct
Name: A, dtype: object

In [68]:
df.iloc[0]

W       -0.993263
X          0.1968
Y       -1.136645
Z        0.000366
multi    0.000072
flag      Correct
Name: A, dtype: object

Or select based off of position instead of label

In [69]:
df.iloc[2] #index row of 2

W        2.154846
X       -0.610259
Y       -0.755325
Z       -0.346419
multi    0.211405
flag      Correct
Name: C, dtype: object

** Selecting subset of rows and columns **

In [78]:
df.loc['B','Y']

-0.031579143908112575

In [79]:
df.loc['B']["Y"]

-0.031579143908112575

In [80]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.993263 -1.136645
B  1.025984 -0.031579

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [81]:
df

          W         X         Y         Z     multi     flag
A -0.993263  0.196800 -1.136645  0.000366  0.000072  Correct
B  1.025984 -0.156598 -0.031579  0.649826 -0.101761  Correct
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405  Correct
D  0.147027 -0.479448  0.558769  1.024810 -0.491343  Correct
E -0.925874  1.862864 -1.133817  0.610478  1.137237  Correct

In [84]:
df.drop(["flag"],axis=1,inplace=True)

In [85]:
# df > 0 will give an error because it is ambiguous - which row or column value should be greater than 0? Any non numeric column if present will throw an error
df>0

       W      X      Y      Z  multi
A  False   True  False   True   True
B   True  False  False   True  False
C   True  False  False  False   True
D   True  False   True   True  False
E  False   True  False   True   True

In [86]:
df[df>0]

          W         X         Y         Z     multi
A       NaN  0.196800       NaN  0.000366  0.000072
B  1.025984       NaN       NaN  0.649826       NaN
C  2.154846       NaN       NaN       NaN  0.211405
D  0.147027       NaN  0.558769  1.024810       NaN
E       NaN  1.862864       NaN  0.610478  1.137237

In [87]:
df[df['W']>0]

          W         X         Y         Z     multi
B  1.025984 -0.156598 -0.031579  0.649826 -0.101761
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405
D  0.147027 -0.479448  0.558769  1.024810 -0.491343

In [88]:
df[df['W']>0]['Y']

B   -0.031579
C   -0.755325
D    0.558769
Name: Y, dtype: float64

In [89]:
df[df['W']>0][['Y','X']]

          Y         X
B -0.031579 -0.156598
C -0.755325 -0.610259
D  0.558769 -0.479448

For two conditions you can use | and & with parenthesis:

In [90]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z, multi]
Index: []

In [91]:
df[(df['W']>0) | (df['Y'] > 1)]

          W         X         Y         Z     multi
B  1.025984 -0.156598 -0.031579  0.649826 -0.101761
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405
D  0.147027 -0.479448  0.558769  1.024810 -0.491343

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [92]:
df

          W         X         Y         Z     multi
A -0.993263  0.196800 -1.136645  0.000366  0.000072
B  1.025984 -0.156598 -0.031579  0.649826 -0.101761
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405
D  0.147027 -0.479448  0.558769  1.024810 -0.491343
E -0.925874  1.862864 -1.133817  0.610478  1.137237

In [93]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z     multi
0     A -0.993263  0.196800 -1.136645  0.000366  0.000072
1     B  1.025984 -0.156598 -0.031579  0.649826 -0.101761
2     C  2.154846 -0.610259 -0.755325 -0.346419  0.211405
3     D  0.147027 -0.479448  0.558769  1.024810 -0.491343
4     E -0.925874  1.862864 -1.133817  0.610478  1.137237

In [94]:
newind = 'CA NY WY OR CO'.split()

In [97]:
df['States'] = newind

In [98]:
df

          W         X         Y         Z     multi States
A -0.993263  0.196800 -1.136645  0.000366  0.000072     CA
B  1.025984 -0.156598 -0.031579  0.649826 -0.101761     NY
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405     WY
D  0.147027 -0.479448  0.558769  1.024810 -0.491343     OR
E -0.925874  1.862864 -1.133817  0.610478  1.137237     CO

In [99]:
df.set_index('States')

               W         X         Y         Z     multi
States
CA     -0.993263  0.196800 -1.136645  0.000366  0.000072
NY      1.025984 -0.156598 -0.031579  0.649826 -0.101761
WY      2.154846 -0.610259 -0.755325 -0.346419  0.211405
OR      0.147027 -0.479448  0.558769  1.024810 -0.491343
CO     -0.925874  1.862864 -1.133817  0.610478  1.137237

In [100]:
df

          W         X         Y         Z     multi States
A -0.993263  0.196800 -1.136645  0.000366  0.000072     CA
B  1.025984 -0.156598 -0.031579  0.649826 -0.101761     NY
C  2.154846 -0.610259 -0.755325 -0.346419  0.211405     WY
D  0.147027 -0.479448  0.558769  1.024810 -0.491343     OR
E -0.925874  1.862864 -1.133817  0.610478  1.137237     CO

In [101]:
df.set_index('States',inplace=True)

In [102]:
df

               W         X         Y         Z     multi
States
CA     -0.993263  0.196800 -1.136645  0.000366  0.000072
NY      1.025984 -0.156598 -0.031579  0.649826 -0.101761
WY      2.154846 -0.610259 -0.755325 -0.346419  0.211405
OR      0.147027 -0.479448  0.558769  1.024810 -0.491343
CO     -0.925874  1.862864 -1.133817  0.610478  1.137237

# Additional Read

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [ ]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [ ]:
hier_index

In [ ]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [ ]:
df.loc['G1']

In [ ]:
df.loc['G1'].loc[1]

In [ ]:
df.index.names

In [ ]:
df.index.names = ['Group','Num']

In [ ]:
df

In [ ]:
df.xs('G1')

In [ ]:
df.xs(['G1',1])

In [ ]:
df.xs(1,level='Num')